; domain
(define (domain minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :conditional-effects :existential-preconditions :constraints :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 box ball - object_
 )
 (:constants
   empty - empty_0
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (increase (total-cost) 1)))
)

; problem
(define (problem minigrid-problem)
 (:domain minigrid-domain)
 (:objects
   room_1 room_2 room_3 room_4 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   red_door_1 green_door_1 purple_door_1 grey_door_1 - door
   grey_ball_3 grey_ball_1 red_ball_1 grey_ball_2 purple_ball_1 - ball
   red_box_1 green_box_1 blue_box_1 - box
 )
 (:init (agentinroom room_2) (objectinroom grey_ball_1 room_1) (objectinroom red_ball_1 room_1) (objectinroom blue_box_1 room_2) (objectinroom red_box_1 room_3) (objectinroom green_box_1 room_3) (objectinroom grey_ball_2 room_3) (objectinroom purple_ball_1 room_3) (objectinroom grey_ball_3 room_4) (objectcolor grey_ball_1 greytype) (objectcolor red_ball_1 redtype) (objectcolor blue_box_1 bluetype) (objectcolor red_box_1 redtype) (objectcolor green_box_1 greentype) (objectcolor grey_ball_2 greytype) (objectcolor purple_ball_1 purpletype) (objectcolor grey_ball_3 greytype) (objectcolor red_door_1 redtype) (objectcolor green_door_1 greentype) (objectcolor purple_door_1 purpletype) (objectcolor grey_door_1 greytype) (emptyhands) (locked red_door_1) (locked green_door_1) (locked purple_door_1) (locked grey_door_1) (adjacentrooms room_2 room_1 red_door_1) (adjacentrooms room_1 room_2 red_door_1) (adjacentrooms room_3 room_1 green_door_1) (adjacentrooms room_1 room_3 green_door_1) (adjacentrooms room_4 room_2 purple_door_1) (adjacentrooms room_2 room_4 purple_door_1) (adjacentrooms room_4 room_3 grey_door_1) (adjacentrooms room_3 room_4 grey_door_1) (visited room_2) (= (total-cost) 0))
 (:goal (and (exists (?v - ball)
 (and (objectcolor ?v greytype) (objectinroom ?v room_4) (agentinroom room_4) (at_ ?v)))))
 (:constraints (sometime (and (at_ blue_box_1) (agentinroom room_1))) (sometime (not (locked purple_door_1))) (sometime-before (not (locked purple_door_1)) (or (carrying red_ball_1) (at_ red_ball_1))) (sometime (agentinroom room_4)) (sometime-before (agentinroom room_4) (and (carrying blue_box_1) (not (locked green_door_1)))) (sometime (not (locked grey_door_1))) (sometime (agentinroom room_3)) (sometime (not (emptyhands))) (sometime (at_ grey_ball_3)) (sometime-before (at_ grey_ball_3) (at_ empty)))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor red_door_1 room_2 room_1)
   added: (at_ red_door_1)
   goals met: 0 of 1
2. (toggle red_door_1)
   deleted: (locked red_door_1)
   goals met: 0 of 1
3. (gotoobject blue_box_1 room_2)
   deleted: (at_ red_door_1)
   added: (at_ blue_box_1)
   goals met: 0 of 1
4. (pick blue_box_1 room_2)
   deleted: (at_ blue_box_1) (emptyhands) (objectinroom blue_box_1 room_2)
   added: (carrying blue_box_1)
   goals met: 0 of 1
5. (gotoroom room_2 room_1 red_door_1)
   deleted: (agentinroom room_2)
   added: (agentinroom room_1) (visited room_1)
   goals met: 0 of 1
6. (gotodoor green_door_1 room_1 room_3)
   added: (at_ green_door_1)
   goals met: 0 of 1
7. (toggle green_door_1)
   deleted: (locked green_door_1)
   goals met: 0 of 1
8. (gotoobject red_ball_1 room_1)
   deleted: (at_ green_door_1)
   added: (at_ red_ball_1)
   goals met: 0 of 1
9. (gotoempty)
   deleted: (at_ red_ball_1)
   added: (at_ empty)
   goals met: 0 of 1
10. (drop blue_box_1 room_1)
   deleted: (carrying blue_box_1) (at_ empty)
   added: (at_ blue_box_1) (emptyhands) (objectinroom blue_box_1 room_1)
   goals met: 0 of 1
11. (gotoroom room_1 room_3 green_door_1)
   deleted: (agentinroom room_1) (at_ blue_box_1)
   added: (agentinroom room_3) (visited room_3)
   goals met: 0 of 1
12. (gotodoor grey_door_1 room_3 room_4)
   added: (at_ grey_door_1)
   goals met: 0 of 1
13. (toggle grey_door_1)
   deleted: (locked grey_door_1)
   goals met: 0 of 1
14. (gotoroom room_3 room_4 grey_door_1)
   deleted: (agentinroom room_3) (at_ grey_door_1)
   added: (agentinroom room_4) (visited room_4)
   goals met: 0 of 1
15. (gotodoor purple_door_1 room_4 room_2)
   added: (at_ purple_door_1)
   goals met: 0 of 1
16. (toggle purple_door_1)
   deleted: (locked purple_door_1)
   goals met: 0 of 1
17. (gotoobject grey_ball_3 room_4)
   deleted: (at_ purple_door_1)
   added: (at_ grey_ball_3)
   goals met: 1 of 1
